# MinorLapSpliceLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..MinorLapSpliceLength Property
FabricSheetType Class See Also
---
The lap splice length in the minor direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MinorLapSpliceLength { get; set; }
```

Visual Basic
---
```text
Public Property MinorLapSpliceLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinorLapSpliceLength {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: minorLapSpliceLength is greater than the half of the overall width. |

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace